// Вывести на экран последнюю цифру целого числа введенного с клавиатуры.
System.Console.WriteLine("Введите число");
double a=Convert.ToDouble(Console.ReadLine());
System.Console.WriteLine($"Последняя цифра {a%10}");


    
