// 80. Вывести на экран кодировку символов по ASCII(с 32 до 122)

for(char c=' ';c<=132;c++) 
 { 
         System.Console.Write(c); 
     System.Console.WriteLine(); 
 }

